# -*- eval: (add-hook 'after-save-hook (lambda nil (org-babel-tangle)) nil t); -*-
#+TITLE: Encyclopedia
#+PROPERTY: header-args:elisp :tangle ~/.emacs.d/lisp/encyclopedia.el :results silent :mkdirp yes
#+STARTUP: overview

** Getters

#+begin_src elisp
(defvar encyclopedia-theme-themes
      (list (cons 'dark encyclopedia-theme-theme-dark)
            (cons 'light encyclopedia-theme-theme-light)))
#+end_src

#+begin_src elisp
(defun encyclopedia-theme-get-theme (theme)
  (assoc theme encyclopedia-theme-themes))
#+end_src

#+RESULTS:
: encyclopedia-theme-get-theme

#+begin_src elisp
(defun encyclopedia-theme-get-color (theme color)
  (cdr (assoc color (encyclopedia-theme-get-theme theme))))
#+end_src

#+RESULTS:
: encyclopedia-theme-get-color

#+begin_src elisp :tangle no
(encyclopedia-theme-get-color 'dark 'bg)
#+end_src

#+RESULTS:
: #282c34

** COMMENT Tags
#+begin_src elisp
(defun encyclopedia-document-get-tags ()
  (interactive)
  (org-roam--extract-tags))
#+end_src

#+begin_src elisp
(defun encyclopedia-document-get-tags-file (file)
  (with-temp-buffer
    (insert-file-contents file)
    (encyclopedia-document-get-tags)))
#+end_src

#+begin_src elisp
(defun encyclopedia-document-get-tags-files ()
  (delete-dups (apply 'append (let ((documents (encyclopedia-document-list-documents)))
                                (mapcar (lambda (file)
                                          (with-temp-buffer
                                            (insert-file-contents file)
                                            (if (encyclopedia-document-thumb-extract)
                                                (encyclopedia-document-get-tags)))) documents)))))
#+end_src

#+begin_src elisp :results replace :tangle no
(encyclopedia-document-get-tags-files)
#+end_src

#+RESULTS:
| statistics | hypothesis | testing | test | dynamical | systems | population | traveling | waves | diffusion | instability | kuramoto | model | oscillator | synchronisation | fractal | tree | recursion | ricker | map | chaos | graph | theory | erdos | renyi | small | world | network | mandelbrot | set | distribution | normal | henon | attractor | linear | least | squares |

